test/tests/mesh/cube_slice/test_6/foaminput/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    Wall-0
    {
        type            calculated;
        value           uniform 100000;
    }
    Wall-1
    {
        type            calculated;
        value           uniform 100000;
    }
    Wall-2
    {
        type            calculated;
        value           uniform 100000;
    }
    Wall-3
    {
        type            calculated;
        value           uniform 100000;
    }
    Wall-4
    {
        type            calculated;
        value           uniform 100000;
    }
    Wall-5
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
