test/tests/mesh/cube_slice/test_6/foaminput/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (18 6 17) simpleGrading (1 1 1)
);

boundary
(
    Wall-0
    {
        type wall;
        faces
        (
             (1 5 4 0)
        );
    }
    Wall-1
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    Wall-2
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    Wall-3
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    Wall-4
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    Wall-5
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
